In [1]:
#Import Pandas
import pandas as pd

#Load Resources file
purchase_data = "HeroesOfPymoli/Resources/purchase_data.csv"

#Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(purchase_data)

In [2]:
#show data frame
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
#get player count, duplicate SN/players, need unique number
player_count = len(purchase_data_df["SN"].unique())
player_count

576

In [4]:
#make data frame for total players for better visuals
total_players_df = pd.DataFrame({"Total Players": [player_count]})

# Player Count

In [5]:
#total number of players
total_players_df

   Total Players
0            576

In [6]:
#calculations for Purchasing Analysis (Total)
#number of unique items
unique_items = len(purchase_data_df["Item ID"].unique())
unique_items

179

In [7]:
#average price
average_price = (purchase_data_df["Price"]).mean()
average_price

3.0509871794871795

In [8]:
#number of purchases
number_purchases = len(purchase_data_df["Purchase ID"])
number_purchases

780

In [9]:
#Total sold
total = (purchase_data_df["Price"]).sum()
total

2379.77

In [10]:
#make summary data frame for the calculations
summary_df = pd.DataFrame({"Number of Unique Items": [unique_items], "Average Price": [average_price], 
                           "Number of Purchases": [number_purchases], "Total Revenue": [total]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [11]:
#checking types for formatting
summary_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [12]:
#format currency
summary_df["Average Price"] = summary_df["Average Price"].map('${0:,.2f}'.format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map('${0:,.2f}'.format)

# Purchasing Analysis (Total)

In [13]:
#summary data frame for purchasing analysis
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [14]:
#calculate the Gender Demographics
#sort for what gender groups there are - this is *NOT* unique, and has duplicate SN/players
gender_groups = purchase_data_df.groupby(["Gender"])
gender_groups.count().head()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [15]:
#unique gender groups count
gender_groups_unique = gender_groups.nunique()["SN"]
gender_groups_unique

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [16]:
#percentage of each gender
percentage_gender = gender_groups_unique / player_count *100
percentage_gender

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: SN, dtype: float64

In [17]:
#make data frame for gender demographics
gender_summary_df = pd.DataFrame({"Total Count": gender_groups_unique, "Percentage of Players": percentage_gender})
gender_summary_df

                       Total Count  Percentage of Players
Gender
Female                          81              14.062500
Male                           484              84.027778
Other / Non-Disclosed           11               1.909722

In [18]:
#check data types for formatting
gender_summary_df.dtypes

Total Count                int64
Percentage of Players    float64
dtype: object

In [19]:
#format percentages
gender_summary_df["Percentage of Players"] = gender_summary_df["Percentage of Players"].map("{:.2f}%".format)

In [20]:
#sort by largest group, removed gender label
gender_summary_df = gender_summary_df.sort_values(["Total Count"], ascending=False)
gender_summary_df.index.name = None

# Gender Demographics

In [21]:
#summary data frame for gender demographics
gender_summary_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

In [22]:
#calculations for purchasing analysis by gender
#continue using the gender_summary_df for calculations
#count the number of purchases
purchase_count_gender = gender_groups["Price"].count()
purchase_count_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [23]:
#average of purchases by gender
average_purchase_gender = gender_groups["Price"].mean()
average_purchase_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [24]:
#total purchases by gender
total_purchase_gender = gender_groups["Price"].sum()
total_purchase_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [25]:
#find the average per person per gender, which is thte total divided by the *unique number* 
avg_per_person_gender = total_purchase_gender / gender_groups_unique
avg_per_person_gender

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [26]:
#summary for gender purchases
gender_purchase_df = pd.DataFrame({"Purchase Count": purchase_count_gender,
                                   "Average Purchase Price": average_purchase_gender, 
                                   "Total Purchase Value": total_purchase_gender, 
                                   "Avg Total Purchase per Person": avg_per_person_gender})
gender_purchase_df.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [27]:
#check types
gender_purchase_df.dtypes

Purchase Count                     int64
Average Purchase Price           float64
Total Purchase Value             float64
Avg Total Purchase per Person    float64
dtype: object

In [28]:
#format prices
gender_purchase_df["Average Purchase Price"] = gender_purchase_df["Average Purchase Price"].map("${:.2f}".format)
gender_purchase_df["Total Purchase Value"] = gender_purchase_df["Total Purchase Value"].map("${0:,.2f}".format)
gender_purchase_df["Avg Total Purchase per Person"] = gender_purchase_df["Avg Total Purchase per Person"].map("${:.2f}".format)

# Purchasing Analysis (Gender)

In [29]:
#summary data frame for gender purchasing analysis
gender_purchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [30]:
#calculate age demographics using bins
#unknown max age, using formula to have max age as last bin
bins_ages = [0,9,14,19,24,29,34,39,purchase_data_df["Age"].max()]
group_ages = ["<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [31]:
#back to using original purchase dataframe
#bin all the info adding Age Ranges category
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins_ages, labels=group_ages, include_lowest=False)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [32]:
#group by ages - this is *NOT* unique
age_groups = purchase_data_df.groupby(["Age Ranges"])
age_groups.count().head(8)

            Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Ranges
<10                  23   23   23      23       23         23     23
10-14                28   28   28      28       28         28     28
15-19               136  136  136     136      136        136    136
20-24               365  365  365     365      365        365    365
25-29               101  101  101     101      101        101    101
30-34                73   73   73      73       73         73     73
35-39                41   41   41      41       41         41     41
40+                  13   13   13      13       13         13     13

In [33]:
#unique values for ages
age_groups_unique = age_groups.nunique()["SN"]
age_groups_unique

Age Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [34]:
#percentage of age ranges
percentage_age = age_groups_unique / player_count *100
percentage_age

Age Ranges
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [35]:
#summary data frame for ages
age_summary_df = pd.DataFrame({"Total Count": age_groups_unique, "Percentage of Players": percentage_age})
age_summary_df

            Total Count  Percentage of Players
Age Ranges
<10                  17               2.951389
10-14                22               3.819444
15-19               107              18.576389
20-24               258              44.791667
25-29                77              13.368056
30-34                52               9.027778
35-39                31               5.381944
40+                  12               2.083333

In [36]:
#check data types
age_summary_df.dtypes

Total Count                int64
Percentage of Players    float64
dtype: object

In [37]:
#format percentages
age_summary_df["Percentage of Players"] = age_summary_df["Percentage of Players"].map("{:.2f}%".format)

# Age Demographics

In [38]:
#summary data frame for age demographics
age_summary_df

            Total Count Percentage of Players
Age Ranges
<10                  17                 2.95%
10-14                22                 3.82%
15-19               107                18.58%
20-24               258                44.79%
25-29                77                13.37%
30-34                52                 9.03%
35-39                31                 5.38%
40+                  12                 2.08%

In [39]:
#purchasing analysis by age group
#purchase count for ages
purchase_count_age = age_groups["Price"].count()
purchase_count_age

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [40]:
#average purchase price for ages
average_purchase_age = age_groups["Price"].mean()
average_purchase_age

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [41]:
#total purchase value for ages
total_age = age_groups["Price"].sum()
total_age

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [42]:
#average total per person per age group using the unique values for ages
avg_person_age = total_age / age_groups_unique
avg_person_age

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [43]:
#summary for purchases by age
age_purchase_summary_df = pd.DataFrame({"Purchase Count": purchase_count_age,
                                       "Average Purchase Price": average_purchase_age,
                                       "Total Purchase Value": total_age,
                                       "Avg Total Purchase per Person": avg_person_age})
age_purchase_summary_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [44]:
#check data types
age_purchase_summary_df.dtypes

Purchase Count                     int64
Average Purchase Price           float64
Total Purchase Value             float64
Avg Total Purchase per Person    float64
dtype: object

In [45]:
#format the prices
age_purchase_summary_df["Average Purchase Price"] = age_purchase_summary_df["Average Purchase Price"].map("${:.2f}".format)
age_purchase_summary_df["Total Purchase Value"] = age_purchase_summary_df["Total Purchase Value"].map("${0:,.2f}".format)
age_purchase_summary_df["Avg Total Purchase per Person"] = age_purchase_summary_df["Avg Total Purchase per Person"].map("${:.2f}".format)

# Purchasing Analysis (Age)

In [46]:
#summary data frame for age purchasing analysis
age_purchase_summary_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

In [47]:
#calculating the top spenders
#back to original data and group by player name
player_groups = purchase_data_df.groupby(["SN"])
player_groups.count().head()

              Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Ranges
SN
Adairialis76            1    1       1        1          1      1           1
Adastirin33             1    1       1        1          1      1           1
Aeda94                  1    1       1        1          1      1           1
Aela59                  1    1       1        1          1      1           1
Aelaria33               1    1       1        1          1      1           1

In [48]:
#purchase count per player
purchase_count_player = player_groups["Price"].count()
purchase_count_player.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Price, dtype: int64

In [49]:
#average purchase price per player
average_by_player = player_groups["Price"].mean()
average_by_player.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [50]:
#total purchase price per player
total_per_player = player_groups["Price"].sum()
total_per_player.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [51]:
#summary for players purchases
player_summary_df = pd.DataFrame({"Purchase Count": purchase_count_player,
                                 "Average Purchase Price": average_by_player,
                                 "Total Purchase Value": total_per_player})
player_summary_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [52]:
#sort by top spenders
player_summary_df = player_summary_df.sort_values(["Total Purchase Value"], ascending=False)

In [53]:
#check types
player_summary_df.dtypes

Purchase Count              int64
Average Purchase Price    float64
Total Purchase Value      float64
dtype: object

In [54]:
#format prices
player_summary_df["Average Purchase Price"] = player_summary_df["Average Purchase Price"].map("${:.2f}".format)
player_summary_df["Total Purchase Value"] = player_summary_df["Total Purchase Value"].map("${:.2f}".format)

# Top Spenders

In [55]:
#summary data frame for top spenders
player_summary_df.head(5)

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

In [56]:
#calculating most popular and most profitable items
#sort by item
item_groups = purchase_data_df.groupby(["Item ID", "Item Name"])
item_groups.count().head()

                            Purchase ID  SN  Age  Gender  Price  Age Ranges
Item ID Item Name
0       Splinter                      4   4    4       4      4           4
1       Crucifer                      4   4    4       4      4           4
2       Verdict                       6   6    6       6      6           6
3       Phantomlight                  6   6    6       6      6           6
4       Bloodlord's Fetish            5   5    5       5      5           5

In [57]:
#purchase count per item
purchase_count_item = item_groups["Price"].count()
purchase_count_item.head()

Item ID  Item Name
0        Splinter              4
1        Crucifer              4
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Price, dtype: int64

In [58]:
#average price per item
item_price = item_groups["Price"].mean()
item_price.head()

Item ID  Item Name
0        Splinter              1.2800
1        Crucifer              2.9425
2        Verdict               2.4800
3        Phantomlight          2.4900
4        Bloodlord's Fetish    1.7000
Name: Price, dtype: float64

In [59]:
#total purchases per item
total_item = item_groups["Price"].sum()
total_item.head()

Item ID  Item Name
0        Splinter               5.12
1        Crucifer              11.77
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Price, dtype: float64

In [60]:
#summary for items
item_summary_df = pd.DataFrame({"Purchase Count": purchase_count_item, 
                                "Item Price": item_price, 
                                "Total Purchase Value": total_item})
item_summary_df.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [61]:
#sort by top spenders
popular_item_df = item_summary_df.sort_values(["Purchase Count"], ascending=False)

In [62]:
#check types
popular_item_df.dtypes

Purchase Count            int64
Item Price              float64
Total Purchase Value    float64
dtype: object

In [63]:
#format prices
popular_item_df["Item Price"] = popular_item_df["Item Price"].map("${:.2f}".format)
popular_item_df["Total Purchase Value"] = popular_item_df["Total Purchase Value"].map("${:.2f}".format)

# Most Popular Items

In [64]:
#summary data frame for most popular items
popular_item_df.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

In [65]:
#got back to original item sort & sort by top spenders
profitable_item_df = item_summary_df.sort_values(["Total Purchase Value"], ascending=False)

In [66]:
#check types
profitable_item_df.dtypes

Purchase Count            int64
Item Price              float64
Total Purchase Value    float64
dtype: object

In [67]:
#format prices
profitable_item_df["Item Price"] = profitable_item_df["Item Price"].map("${:.2f}".format)
profitable_item_df["Total Purchase Value"] = profitable_item_df["Total Purchase Value"].map("${:.2f}".format)

# Most Profitable Items

In [68]:
#summary data frame for most profitable items
profitable_item_df.head(5)

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80